PPUC/ZeDMD/src/displays/Esp32LedMatrix.h
#ifndef ESP32LEDMATRIX_H
#define ESP32LEDMATRIX_H

#if defined(ARDUINO_ESP32_S3_N16R8)
#define R1_PIN 4
#define G1_PIN 5
#define B1_PIN 6
#define R2_PIN 7
#define G2_PIN 15
#define B2_PIN 16
#define A_PIN 18
#define B_PIN 8
#define C_PIN 3
#define D_PIN 42
#define E_PIN 1  // required for 1/32 scan panels, like 64x64.
#define LAT_PIN 40
#define OE_PIN 2
#define CLK_PIN 41
#elif defined(ARDUINO_ADAFRUIT_MATRIXPORTAL_ESP32S3)
#define R1_PIN 42
#define G1_PIN 41
#define B1_PIN 40
#define R2_PIN 38
#define G2_PIN 39
#define B2_PIN 37
#define A_PIN 45
#define B_PIN 36
#define C_PIN 48
#define D_PIN 35
#define E_PIN 21
#define LAT_PIN 47
#define OE_PIN 14
#define CLK_PIN 2
#else
// Pinout derived from ESP32-HUB75-MatrixPanel-I2S-DMA.h
#define R1_PIN 25
#define G1_PIN 26
#define B1_PIN 27
#define R2_PIN 14
#define G2_PIN 12
#define B2_PIN 13
#define A_PIN 23
#define B_PIN 19
#define C_PIN 5
#define D_PIN 17
#define E_PIN \
  22  // required for 1/32 scan panels, like 64x64. Any available pin would do,
      // i.e. IO32. If 1/16 scan panels, no connection to this pin needed
#define LAT_PIN 4
#define OE_PIN 15
#define CLK_PIN 16

#endif

#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>

#include "LedMatrix.h"

class Esp32LedMatrix final : public LedMatrix {
 private:
  MatrixPanel_I2S_DMA *dma_display;
  const uint8_t lumval[16] = {0,  2,  4,  7,   11,  18,  30,  40,
                              50, 65, 80, 100, 125, 160, 200, 255};

 public:
  Esp32LedMatrix();            // Constructor
  ~Esp32LedMatrix() override;  // Destructor

  void DrawPixel(uint16_t x, uint16_t y, uint8_t r, uint8_t g,
                 uint8_t b) override;
  void DrawPixel(uint16_t x, uint16_t y, uint16_t color) override;

  void ClearScreen() override;
  void SetBrightness(uint8_t level) override;
  void FillScreen(uint8_t r, uint8_t g, uint8_t b) override;
};

#endif  // ESP32LEDMATRIX_H
